{
    "Header.Item1": "Về tôi",
    "Header.Item2": "Kinh nghiệm",
    "Header.Item3": "Dự án",
    "Header.Item4": "Liên hệ",
    "Header.cvBtn": "Resume",
    "Header.cvName": "CV_Nguyen-Thanh-Thien.pdf",
    "Banner.Pretitle": "Xin chào! Tôi là",
    "Banner.Description": "Tôi đã có hơn <span class='underline'>5 năm kinh nghiệm</span> trong lập trình, kinh nghiệm làm outsource phần mềm, phát triển hệ thống, giao tiếp và giải pháp kỹ thuật cho các hệ thống bán lẻ hàng tiêu dùng nhanh (FMCG) như các siêu thị, cửa hàng tiện lợi, cửa hàng thực phẩm. Tôi thích viết, cải tiến code với tiêu chí sạch, có thể tái sử dụng và có thể mở rộng với các ngôn ngữ <span class='underline'>Angular, NodeJS, .NET Core, ASP .NET</span> và một ít ngôn ngữ <span class='underline'>Python</span>.",
    "Banner.ActionBtn": "Liên hệ tôi",
    "AboutMe.Title": "Về tôi",
    "AboutMe.Paragraphs": [
        "Trong hơn 5 năm kinh nghiệm của tôi với <span class='underline'>1 năm làm về Outsource</span> và <span class='underline'>4 năm lập trình</span>, tôi luôn tìm tòi học hỏi mỗi ngày. Tôi đã từng viết test case cho unit testing và test phần mềm, và phát triển tính năng, phần mềm với <span class='underline'>NET. Core, ASP .NET, Angular, NodeJS, MongoDB and SQL Server</span>. Cùng với team của mình phát triển và đưa tính năng đến người dùng với mức hoàn thiện nhất và vẫn đảm bảo tính logic của hệ thống.",
        "Kỹ năng của tôi cũng bao gồm cả việc triển khai cải tiến hệ thống, tối ưu tính năng, site cùng với đó là chuẩn hóa pattern và gợi ý, thực hiện các ý tưởng đóng góp chung vào dự án đang phụ trách.",
        "Các công nghệ mà tôi đã học và làm (có thể mở rộng nếu có cơ hội):"
    ],
    "Experience.Title": "Kinh nghiệm",
    "Experience.Jobs": [
        {
            "Tab": "FUJINET SYSTEMS JSC",
            "Title": "Development",
            "Date": "April 2018 - March 2019",
            "Description": [
                "Customize hệ thống quản lý bán hàng, như phiếu order, quản lý kho, quản lý chi trả. v.v…",
                "Lập trình mới thêm chức năng, chỉnh sửa 1 số chức năng có sẵn của sofware Package quản lí xây dựng.",
                "Đọc hiểu yêu cầu khách hàng.",
                "Có kinh nghiệm sử dụng các công cụ quản lý lập trình (TFS, SVN)",
                "Kinh nghiệm làm việc với SQL Server"
            ]
        },
        {
            "Tab": "PowersoftVN",
            "Title": "R&D team",
            "Date": "August 2019 - November 2021",
            "Description": [
                "Nghiên cứu và phát triển ứng dụng web sử dụng Angular, Node.js, .NET Core và SQLServer (Topos Go)",
                "Thiết kế và triển khai các RESTful APIs hỗ trợ nhiều ứng dụng trong hệ sinh thái, sử dụng .NET Core.",
                "Phát triển ứng dụng nhận diện khuôn mặt Machine Learning"
            ]
        },
        {
            "Tab": "PowersoftVN",
            "Title": "Deployment staff",
            "Date": "December 2021 - April  2023",
            "Description": [
                "Triển khai và bảo trì ứng dụng web sử dụng Angular, Node.js, .NET Core và SQLServer, với mục tiêu cải thiện trải nghiệm người dùng và tăng hiệu suất.",
                "Phát triển API và service tổng kết dữ liệu bán hàng qua Zalo.",
                "Phát triển API kết nối các cổng thanh toán online cho hệ thống POS như MoMo, ZaloPay, ShopeePay, Moca, VNPay...",
                "Cải thiện hiệu suất sản phẩm."
            ]
        }
    ],
    "FeatureProjects.Title": "Các project đã tham gia",
    "FeatureProjects.Label": "Project chính",
    "FeatureProjects.Projects": [
        {
            "Title": "Reporting Tool",
            "Description": "Phát triển web thiết kế và xem các báo cáo tổng hợp dựa trên Devexpress Dashboard và SQL Server cùng với OLAP để có các báo cáo đa chiều và xuyên suốt theo thời gian",
            "imgs": [
                "assets/images/ToposROT/image1.jpg"
            ],
            "Technologies": [
                "ASP .NET",
                "Devexpress",
                "OLAP",
                "SQL Server"
            ]
        },
        {
            "Title": "TOPOS version mới",
            "Description": "Thiết kế UI mới cho phần mềm bán hàng trên nền tảng công nghệ <span class='underline'>WPF</span> của Microsoft.",
            "imgs": [
                "assets/images/newversion/image1.jpg"
            ],
            "Technologies": [
                "WPF",
                "XAML"
            ]
        },
        {
            "Title": "Ứng dụng nhận diện khuôn mặt",
            "Description": "Phát triển ứng dụng sử dụng <span class='underline'>Python</span> và <span class='underline'>InfluxDB</span> cùng thiết bị NCS2 của Intel để nhận diện khuôn mặt khách hàng thành viên, nhận diện giới tính, tuổi thông qua camera.",
            "imgs": [
                "assets/images/ncs/image1.jpg",
                "assets/images/ncs/image2.jpg"
            ],
            "Technologies": [
                "Python",
                "InfluxDB",
                "Machine Learning"
            ]
        },
        {
            "Title": "TOPOS Go",
            "Description": "Phát triển webapp bán hàng trên thiết bị mobile sử dụng <span class='underline'>Angular</span> và <span class='underline'>SPA</span> đảm bảo hoạt động ứng dụng trong các tình trạng mạng khác nhau.",
            "imgs": [
                "assets/images/ToposGo/image1.jpg",
                "assets/images/ToposGo/image2.jpg",
                "assets/images/ToposGo/image3.jpg"
            ],
            "Technologies": [
                "Angular",
                "NodeJS",
                "TypeScript",
                ".NET Core",
                "SQL Server"
            ]
        },
        {
            "Title": "Zalo Integrated Notification",
            "Description": "Phát triển API và service thực hiện việc tổng kết dữ liệu bán hàng cuối ngày hoặc theo tương tác trên Zalo và gửi theo dạng tin nhắn báo cáo hoặc file pdf.",
            "imgs": [
                "assets/images/ZIN/image1.jpg",
                "assets/images/ZIN/image2.jpg",
                "assets/images/ZIN/image3.jpg"
            ],
            "Technologies": [
                ".NET Core",
                "Window Service",
                "SQL Server"
            ]
        },
        {
            "Title": "Payment Gateway",
            "Description": "Phát triển API kết nối các phương thức thanh toán online với các client của hệ thống POS: GrabPay, ZaloPay, ShopeePay, VNPay, Momo và các kênh về Voucher: GotIt, Urbox.",
            "imgs": [
                "assets/images/PG/image1.png",
                "assets/images/PG/image2.jpg"
            ],
            "Technologies": [
                ".NET Core",
                "Window Service",
                "SQL Server"
            ]
        }
    ],
    "Contact.Pretitle": "Điều gì tiếp theo",
    "Contact.Title": "Liên lạc với tôi!",
    "Contact.Content": "Rất vui nếu nhận được thông tin từ bạn về các cơ hội mới. Gửi cho tôi thông tin, và tôi sẽ trả lời sớm nhất khi tôi nhận được thông tin của bạn.",
    "Contact.Btn": "Xin chào"
}
